---
kind: type
id: T:Autodesk.Revit.DB.SpecUtils
source: html/21c660df-947f-4aa4-29f0-f3cd78f62d6c.htm
---
# Autodesk.Revit.DB.SpecUtils

A utility class of functions related to specs. A spec describes a data type that parameters can hold.

## Syntax (C#)
```csharp
public static class SpecUtils
```